Revit 2026 API

# SpatialElementTagRotationAngle Property

---

The rotation angle of the tag relative to its view

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double RotationAngle { get; set; }
```
```vb
Public Property RotationAngle As Double
	Get
	Set
```
```cpp
public:
property double RotationAngle {
	double get ();
	void set (double value);
}
```
```fsharp
member RotationAngle : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Angle can only be changed for Model orientation |

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace